/**
██████   █████  ██████  ██   ██     ███████  █████  ███    ███ ██    ██ ███████  █████      ██    ██ ███████ 
██   ██ ██   ██ ██   ██ ██  ██      ██      ██   ██ ████  ████ ██    ██    ███  ██   ██     ██    ██ ██      
██   ██ ███████ ██████  █████       ███████ ███████ ██ ████ ██ ██    ██   ███   ███████     ██    ██ ███████ 
██   ██ ██   ██ ██   ██ ██  ██           ██ ██   ██ ██  ██  ██ ██    ██  ███    ██   ██      ██  ██       ██ 
██████  ██   ██ ██   ██ ██   ██     ███████ ██   ██ ██      ██  ██████  ███████ ██   ██       ████   ███████ 
                                                                                                             
                                                                                                             
 **/











/** 



This File No Code


**/


























const { tlang,cmd,prefix } = require('../lib')
const Config = require('../config')
const maker = require('mumaker')

    //---------------------------------------------------------------------------
const _0x40d947=_0x577b;function _0x577b(_0x5f2f34,_0x3e03ad){const _0xcef2c1=_0xcef2();return _0x577b=function(_0x577bf8,_0x5175ad){_0x577bf8=_0x577bf8-0x1d0;let _0x2e7a0d=_0xcef2c1[_0x577bf8];return _0x2e7a0d;},_0x577b(_0x5f2f34,_0x3e03ad);}function _0xcef2(){const _0x400c67=['textpro','654634oUDnkE','greet','5ElMUoj','589580AxBTkO','title','1066024QMSXkt','check','\x20🥷⃟⛷️\x20','244554KLLZbW','sendMessage','chat','🥷⃟⛷️.*ᴍᴀᴅᴇ\x20ʙʏ\x20:-*\x20','18PdDfft','46249mPjOOy','3222098jXmSOV','1FBbGsq','https://fdown.net/download.php','150qSfnvQ','867430mWdgcI'];_0xcef2=function(){return _0x400c67;};return _0xcef2();}(function(_0x79c101,_0x2e6c40){const _0x22a94b=_0x577b,_0x3c3ff8=_0x79c101();while(!![]){try{const _0x19c1fc=parseInt(_0x22a94b(0x1e3))/0x1*(parseInt(_0x22a94b(0x1d4))/0x2)+-parseInt(_0x22a94b(0x1dc))/0x3+parseInt(_0x22a94b(0x1d7))/0x4*(parseInt(_0x22a94b(0x1d6))/0x5)+parseInt(_0x22a94b(0x1d1))/0x6*(-parseInt(_0x22a94b(0x1e1))/0x7)+-parseInt(_0x22a94b(0x1d9))/0x8*(parseInt(_0x22a94b(0x1e0))/0x9)+-parseInt(_0x22a94b(0x1d2))/0xa+parseInt(_0x22a94b(0x1e2))/0xb;if(_0x19c1fc===_0x2e6c40)break;else _0x3c3ff8['push'](_0x3c3ff8['shift']());}catch(_0x158fda){_0x3c3ff8['push'](_0x3c3ff8['shift']());}}}(_0xcef2,0x28f08),cmd({'pattern':_0x40d947(0x1da),'alias':['testbot'],'category':'textpro','react':'⛷️','desc':'Some\x20text\x20to\x20image\x20feature\x20with\x20various\x20styles.'},async(_0x1cb754,_0x109454,_0x2d7ed7)=>{const _0x335269=_0x40d947;if(!_0x2d7ed7)return _0x109454['react']('⛷️');let _0x37e016=await maker[_0x335269(0x1d3)](_0x335269(0x1d0),Url);_0x1cb754[_0x335269(0x1dd)](_0x109454[_0x335269(0x1de)],{'video':{'url':_0x37e016},'caption':_0x335269(0x1df)+tlang()[_0x335269(0x1d8)]+_0x335269(0x1db)+tlang()[_0x335269(0x1d5)]},{'quoted':_0x109454});}));                    
